In [1]:
import numpy as np
import pandas as pd
from pandas import Series as s, DataFrame as df

In [2]:
ser1 = s([0,1,2], index=['A', 'B', 'C'])
ser1

A    0
B    1
C    2
dtype: int64

In [3]:
ser2 = s([3,4,5,6], index=['A', 'B', 'C', 'D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [4]:
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [6]:
df1 = df(np.arange(4).reshape((2,2)), columns=list('AB'), index=['SF', 'LA'])
df1

    A  B
SF  0  1
LA  2  3

In [7]:
df2 = df(np.arange(9).reshape((3,3)), columns=list('ADC'), index=['SF', 'NYC', 'LA'])
df2

     A  D  C
SF   0  1  2
NYC  3  4  5
LA   6  7  8

In [8]:
df1 + df2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  NaN NaN NaN NaN
SF   0.0 NaN NaN NaN

In [9]:
df1.add(df2, fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  3.0  NaN  5.0  4.0
SF   0.0  1.0  2.0  1.0

In [10]:
ser3 = df2.ix[0]
ser3

A    0
D    1
C    2
Name: SF, dtype: int64

In [11]:
df2-ser3

     A  D  C
SF   0  0  0
NYC  3  3  3
LA   6  6  6